websockets/websockets.yml
config:
  target: "ws://localhost:8888/"
  processor: "./helpers/build-message-request.js"
  phases:
    - duration: 30
      arrivalRate: 200
      rampTo: 300
      name: 'Phase 1 - 300 users - rate 200/s'
    - duration: 30
      arrivalRate: 300
      rampTo: 500
      name: 'Phase 2 - 500 users - rate 300/s'
scenarios:
  - name: "Save Score"
    engine: ws
    flow:
      - function: "sendScoreRequest"
      - send: "{{ message_send_score }}"
  - name: "Delete Score every 5 second"
    engine: ws
    flow:
      - think: 5
      - function: "deleteKey"
      - send: "{{ message_delete_key }}"